/* let age = +prompt("Баға еңіиз")

if (age >=90 && age <= 100) {
    alert("Жарайсыз сенин баган А")
}
else if(age >=80 && age <90){
    alert("Жарайсыз сенин баган B")
}
else if (age>=70 && age<=80){
    alert("Жарайсыз сенин баган C");
    
}
else if (age>=50 && age<=70){
    alert("Жарайсыз сенин баган D");
    
}
else {
    alert("Сиз перекус")
}
    */

/* let age = prompt("БУргер тури чизбургер/Гамбургер/дв.Чизбургер")
if (age >Чизбургер) {
    alert("Сиздин заказ кабылданды  Бургер тури:Чизбургер  Сумма:1190")
}
else if(age >Гамбургер){
    alert("Сиздин заказ кабылданды n\ Бургер тури:Чизбургер n\ Сумма:1192")
}
else if (age >Гамбургер){
    alert("Сиздин заказ кабылданды n\ Бургер тури:Чизбургер n\ Сумма:1194");
    
}
else if (age >дв.Чизбургер){
    alert("Сиздин заказ кабылданды n\ Бургер тури:Чизбургер n\ Сумма:1195");
    
}
else {
    alert("Заказ берсей")
}


 */
//1
let curs = (prompt("Курс нөмірін енгізіңіз (1/2/3/4)"))
let isAlmaty = prompt("Сіз Алматыдан келдіңіз бе? yes/no")

if (curs < 3 && isAlmaty === "no") {
    alert("Сізге жатақханадан орын беріледі")
} 
else {
    alert("сізге жатақханадан орын берілмейді")
}

//2
alert("Ойын шарты: дұрыс жауап берілген әр сұрақа 1 бал беріледі")

let score = 0;

let surak1 = prompt("Қазақстанның тәуелсіздігін қашан алды?");
console.log("жауап:", surak1)

if (surak1 == 1991) {
    score += 1;
}

let surak2 = prompt("Қазір қай қалада оқып жатсыз?"); 
console.log("жауап", surak2);

if (surak2 === "Almaty") {
    score += 1;
}

alert("Сіздің жинаған ұпайыңыз: " + score);